{
  "vehicles": [
    {
      "id": 0,
      "name": "Toyota",
      "model": "RAV4",
      "year": "2020"
    },
    {
      "id": 1,
      "name": "Toyota",
      "model": "Camry",
      "year": "2020"
    },
    {
      "id": 2,
      "name": "Toyota",
      "model": "Corolla",
      "year": "2020"
    },
    {
      "id": 3,
      "name": "Nissan",
      "model": "Sentra",
      "year": "2020"
    },
    {
      "id": 4,
      "name": "Nissan",
      "model": "Altima",
      "year": "2020"
    }
  ],
  "parts": [
    {
      "id": 0,
      "name": "air filter",
      "price": "15.99",
      "description": "STP Air Filter SA90214.  Duralast brake pads are designed to provide reliable performance for the everyday driver. Duralast brake pads use platform specific friction materials with both Ceramic and Semi-Metallic formulations. If you are experiencing longer stopping distances or if your brakes are squealing, Duralast Pads are a good replacement choice for you."
    },
    {
      "id": 1,
      "name": "brake pads",
      "price": "24.99",
      "description": "Duralast Brake Pads D1879.  Duralast brake pads are designed to provide reliable performance for the everyday driver. Duralast brake pads use platform specific friction materials with both Ceramic and Semi-Metallic formulations. If you are experiencing longer stopping distances or if your brakes are squealing, Duralast Pads are a good replacement choice for you."
    },
    {
      "id": 2,
      "name": "oil filter",
      "price": "9.99",
      "description": "STP Extended Life Oil Filter S2878XL.  STP Extended Life Oil Filters provide maximum protection for your vehicle's engine. Its superior synthetic blend media traps contaminants with 99% efficiency over the life of the filter."
    },
    {
      "id": 3,
      "name": "shock absorber",
      "price": "129.99",
      "description": "Rancho RS9000XL Shock Absorber.  Rancho's® new RS9000XL shock absorbers feature adjustable damping with either a 2.75- or 2.38-in. diameter reserve tube. This massive shock body allows the RS9000XL to run cooler and more consistent even under the most demanding towing conditions, enhancing performance and durability."
    },
    {
      "id": 4,
      "name": "alternator",
      "price": "164.99",
      "description": "Duralast Alternator 14084.  Duralast alternators are remanufactured with the most current technological improvements and triple tested to provide original equipment quality and durability."
    },
    {
      "id": 5,
      "name": "spark plug",
      "price": "8.79",
      "description": "NGK IX Iridium Spark Plug 3764.  NGK Iridium IX spark plugs are designed specifically for the performance enthusiast. Iridium IX spark plugs offer extreme ignitibility, improved throttle response and superior anti-fouling."
    },
    {
      "id": 6,
      "name": "fuel pump",
      "price": "499.99",
      "description": "Delphi Fuel Pump CHM10121.  100 years of OE experience, supplier to the world's top automakers, OE Heritage and knowledge built into every aftermarket part, comprehensive portfolio for a wide range of vehicles and model years."
    }
  ]
}
